app/controllers/tasks_controller.rb

  def create
    @task = @tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("account_id", "created_at", "description", "is_done", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_id", 1], ["created_at", "2016-12-03 19:14:32.230252"], ["description", "pasea el dog"], ["is_done", "f"], ["name", "brale"], ["updated_at", "2016-12-03 19:14:32.230252"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["description", "pasea el doggis"], ["updated_at", "2016-12-03 19:15:22.843185"]]

    def set_task
      @task = current_account.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."account_id" = ? AND "tasks"."id" = ? LIMIT 1  [["account_id", 1], ["id", 4]]